Tekla Open API Reference for Tekla Structures 2025
ComponentInput Properties
The ComponentInput type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace